Revit 2027 API
ContourSettingItem.Type Property
 The contour setting item type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ContourSettingItemType Type { get; }
Public ReadOnly Property Type As ContourSettingItemType
	Get
public:
property ContourSettingItemType Type {
	ContourSettingItemType get ();
}
member Type : ContourSettingItemType with get
Property Value
ContourSettingItemType
See Also
Reference
ContourSettingItem Class
Autodesk.Revit.DB Namespace